let out = document.querySelector('.out');
console.log(out);

for (let i = 0; i < 5; i++) {
    // i=0 i станет равно нулю 
    for (let k = 0; k < 10; k++) {
        // k=0  k станет равно нулю и будет выведена звездочка
        out.innerHTML += '*';
    }
    out.innerHTML += '<br>';
}
////////////////////////////////////////////
// таблица умножения при помощи вложенного цикла
for (let i = 1; i <= 9; i++) {
    for (let k = 1; k < 10; k++) {
        // out.innerHTML += '3*' + i + '=' + (i * 3) + '<br>'; таблица умножения
        out.innerHTML += `${i}*${k}=${k * i}<br>`;  // таже строка что и выше при помощи интерполяции
    }
    out.innerHTML += '<hr>';
}

/////////////////////////////////////
//          Task 1
//   С помощью вложенных циклов, нарисуйте строку:

//      ***_***_***_
for (let i=0; i <3; i++) {
    out.innerHTML += '***';
    for (let k=0; k < 1; k++){
        out.innerHTML += '_';
    }   
}

///////////////////////////////////////
//               Task 2
//  С помощью вложенных циклов, нарисуйте строку:

//  1
//  *_*_*_
//  2
//  *_*_*_
//  3
//  *_*_*_
//    Решить задачу с помощью вложенных циклов. Внешний
//   цикл выводит цифры и перенос строки
//    br, , второй звездочки, знак подчеркивания и знак
//     переноса.
let out1 = document.querySelector('.out1');
for (let i=1; i <= 3; i++){
    
    out1.innerHTML += `${i}<br>`;
    
    for (let k = 0; k < 1; k++){
        out1.innerHTML += `*_*_*_<br>`;  
        
    }
}

////////////////////////////////////////////
// Task 3
// С помощью вложенных циклов, нарисуйте строку:

// *_*_*_
// *_*_*_
// *_*_*_
// *_*_*_
// Решить задачу с помощью вложенных циклов.
//  Внешний цикл выводит перенос строки br,
//   внутренний - звездочки, знак подчеркивания.
let out2 = document.querySelector('.out2');

for (let i = 0; i < 4; i++) {
    out2.innerHTML += `<br>`;
    for (let k = 0; k < 1; k++) {
        out2.innerHTML += `*_*_*_`;
    }
}
